codebase/projects/ws-client/misc/RequestSecurityToken_ADFS_trial2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header>		
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:02240d0b-95c3-47f2-bab7-22de3491a28e</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://r0177808idm.mayo.edu/adfs/services/trust/13/usernamemixed/</To>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			soap:mustUnderstand="true">
			<wsse:UsernameToken
				xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				wsu:Id="UsernameToken-2">
				<wsse:Username>user</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<wst:RequestSecurityToken
			xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
			<wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType>
			<wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
				<wsa:EndpointReference xmlns:wsa="http://www.w3.org/2005/08/addressing">
					<wsa:Address>http://www.sample.com/</wsa:Address>
				</wsa:EndpointReference>
			</wsp:AppliesTo>
		</wst:RequestSecurityToken>
	</soap:Body>
</soap:Envelope>
